ext_alsav/DataProcessors/ВО_ШтрихкодыСозданиеВторого.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВО_ШтрихкодыСозданиеВторого</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/DataProcessors/ВО_ШтрихкодыСозданиеВторого/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьЗаписиШК(Команда)
	//СоздатьЗаписиШКНаСервере("2010418036759","4650104181158");
	
	Для НомСтр = 2 По ШКТаблица.ВысотаТаблицы Цикл        
        Если ЗначениеЗаполнено(ШКТаблица.Область("R" + (НомСтр) + "C2").Текст) Тогда 
            шк1 = (ШКТаблица.Область("R" + (НомСтр) + "C1").Текст);
			шк2 = (ШКТаблица.Область("R" + (НомСтр) + "C2").Текст);
            СоздатьЗаписиШКНаСервере(шк1,шк2);
        КонецЕсли;        
    КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьЗаписиШКНаСервере(шк1,шк2)
	// Вставить содержимое обработчика. 
	
	нз1 = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	нз1.Штрихкод = шк1;
	нз1.Прочитать();
	
	Если нз1.Выбран() Тогда           
		нз2 = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		нз2.Штрихкод = шк2;
		нз2.Прочитать();
		Если НЕ нз2.Выбран() Тогда
			нз2.Штрихкод = шк2;
			нз2.Номенклатура = нз1.Номенклатура;
			нз2.Характеристика = нз1.Характеристика;
			нз2.Упаковка = нз1.Упаковка;
			нз2.Записать(ложь);
		КонецЕсли;
	Иначе
		Сообщить("ШК не найден "+шк1);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Элементы.ШКТаблица.ТолькоПросмотр = ложь;
	Элементы.ШКТаблица.Редактирование = истина;
	Элементы.ШКТаблица.ОтображатьСетку = истина;
	Элементы.ШКТаблица.ОтображатьЗаголовки = истина;
	Элементы.ШКТаблица.ОтображатьИменаСтрокИКолонок = истина;
	
	ШКТаблица.Область("R1C1").Текст = "Старый ШК";
	ШКТаблица.Область("R1C2").Текст = "Новый ШК";
	
КонецПроцедуры
